results/constant_load/k6_contant_load_test_summary.txt
k6 output summary:

         /\      Grafana   /??/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ??\
  /          \   |   (  |  (?)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: test_constant_load.js
        output: json (raw_results_constant_load.jsonrun)

     scenarios: (100.00%) 1 scenario, 10 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10m0s (gracefulStop: 30s)


     data_received..................: 302 MB 501 kB/s
     data_sent......................: 1.3 MB 2.2 kB/s
     getBlock.......................: avg=93.039558 min=67.0787   med=84.5336   max=390.9433  p(90)=116.84374 p(95)=143.79702
     http_req_blocked...............: avg=0.33ms    min=0.00ms    med=0.00ms    max=98.98ms   p(90)=0.00ms    p(95)=0.00ms
     http_req_connecting............: avg=0.07ms    min=0.00ms    med=0.00ms    max=20.88ms   p(90)=0.00ms    p(95)=0.00ms
     http_req_duration..............: avg=85.49ms   min=17.12ms   med=82.82ms   max=390.94ms  p(90)=114.85ms  p(95)=137.70ms
       { expected_response:true }...: avg=85.49ms   min=17.12ms   med=82.82ms   max=390.94ms  p(90)=114.85ms  p(95)=137.70ms
     http_req_failed................: 0.00%  0 out of 2880
     http_req_receiving.............: avg=47.67ms   min=0.00ms    med=43.95ms   max=340.38ms  p(90)=73.23ms   p(95)=90.04ms
     http_req_sending...............: avg=0.47ms    min=0.00ms    med=0.47ms    max=4.16ms    p(90)=0.85ms    p(95)=1.06ms
     http_req_tls_handshaking.......: avg=0.20ms    min=0.00ms    med=0.00ms    max=60.90ms   p(90)=0.00ms    p(95)=0.00ms
     http_req_waiting...............: avg=37.36ms   min=16.30ms   med=36.50ms   max=299.45ms  p(90)=41.67ms   p(95)=46.02ms
     http_reqs......................: 2880   4.783453/s
     iteration_duration.............: avg=2087.11ms min=2017.75ms med=2084.11ms max=2391.42ms p(90)=2116.01ms p(95)=2138.83ms
     iterations.....................: 2880   4.783453/s
     systemChain....................: avg=19.850598 min=17.1191   med=19.489    max=47.8312   p(90)=21.8018   p(95)=23.47324
     vus............................: 1      min=1         max=10
     vus_max........................: 10     min=10        max=10


running (10m02.1s), 00/10 VUs, 2880 complete and 0 interrupted iterations
default ? [======================================] 10 VUs  10m0s